# Merging DataFrames

In [1]:
import pandas as pd
df = pd.DataFrame([{'Name':'Kevin','Item_Purchased':'Chocolates','Cost':3.50},
                  {'Name':'Angela','Item_Purchased':'Kitty Litter','Cost':9.50},
                  {'Name':'Jim','Item_Purchased':'Ring','Cost':50.00}],
                 index=['Store 1','Store 1','Store 2'])
df

         Cost Item_Purchased    Name
Store 1   3.5     Chocolates   Kevin
Store 1   9.5   Kitty Litter  Angela
Store 2  50.0           Ring     Jim

In [2]:
df['Date'] = ['Dec 1', 'Jan 1','Mid May']
df

         Cost Item_Purchased    Name     Date
Store 1   3.5     Chocolates   Kevin    Dec 1
Store 1   9.5   Kitty Litter  Angela    Jan 1
Store 2  50.0           Ring     Jim  Mid May

In [3]:
df['Delivered']=True

In [4]:
df

         Cost Item_Purchased    Name     Date  Delivered
Store 1   3.5     Chocolates   Kevin    Dec 1       True
Store 1   9.5   Kitty Litter  Angela    Jan 1       True
Store 2  50.0           Ring     Jim  Mid May       True

In [5]:
df['FeedBack'] = ['Positive',None,'Negative']
df

         Cost Item_Purchased    Name     Date  Delivered  FeedBack
Store 1   3.5     Chocolates   Kevin    Dec 1       True  Positive
Store 1   9.5   Kitty Litter  Angela    Jan 1       True      None
Store 2  50.0           Ring     Jim  Mid May       True  Negative

In [6]:
adf = df.reset_index()
adf

     index  Cost Item_Purchased    Name     Date  Delivered  FeedBack
0  Store 1   3.5     Chocolates   Kevin    Dec 1       True  Positive
1  Store 1   9.5   Kitty Litter  Angela    Jan 1       True      None
2  Store 2  50.0           Ring     Jim  Mid May       True  Negative

In [7]:
adf['Date'] = pd.Series({0:'Dec 1',2:'Mid May'})
adf

     index  Cost Item_Purchased    Name     Date  Delivered  FeedBack
0  Store 1   3.5     Chocolates   Kevin    Dec 1       True  Positive
1  Store 1   9.5   Kitty Litter  Angela      NaN       True      None
2  Store 2  50.0           Ring     Jim  Mid May       True  Negative

## Merge DataFrames

In [8]:
staff_df = pd.DataFrame([{'Name':'Pam','Role':'Receptionist'},
                         {'Name':'Jim','Role':'Sales Man'},
                         {'Name':'Mike','Role':'Manager'}
                        ])
staff_df = staff_df.set_index('Name')

In [9]:
staff_df

              Role
Name
Pam   Receptionist
Jim      Sales Man
Mike       Manager

In [10]:
student_df = pd.DataFrame([{'Name':'Mike','School':'Business'},
                           {'Name':'Kevin','School':'Accounting'},
                           {'Name':'Jim','School':'Marketing'}
                          ])
student_df

    Name      School
0   Mike    Business
1  Kevin  Accounting
2    Jim   Marketing

In [11]:
student_df = student_df.set_index('Name')
student_df

           School
Name
Mike     Business
Kevin  Accounting
Jim     Marketing

In [12]:
pd.merge?

In [13]:
pd.merge(staff_df,student_df,how='outer',left_index=True,right_index=True)

               Role      School
Name
Jim       Sales Man   Marketing
Kevin           NaN  Accounting
Mike        Manager    Business
Pam    Receptionist         NaN

In [14]:
pd.merge(staff_df,student_df,how='inner',left_index=True,right_index=True)

           Role     School
Name
Jim   Sales Man  Marketing
Mike    Manager   Business

In [15]:
pd.merge(staff_df,student_df,how='left',left_index=True,right_index=True)

              Role     School
Name
Pam   Receptionist        NaN
Jim      Sales Man  Marketing
Mike       Manager   Business

In [16]:
pd.merge(staff_df,student_df,how='right',left_index=True,right_index=True)

            Role      School
Name
Mike     Manager    Business
Kevin        NaN  Accounting
Jim    Sales Man   Marketing

In [17]:
staff_df = staff_df.reset_index()

In [18]:
staff_df

   Name          Role
0   Pam  Receptionist
1   Jim     Sales Man
2  Mike       Manager

In [19]:
student_df = student_df.reset_index()
student_df

    Name      School
0   Mike    Business
1  Kevin  Accounting
2    Jim   Marketing

In [20]:
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

   Name          Role     School
0   Pam  Receptionist        NaN
1   Jim     Sales Man  Marketing
2  Mike       Manager   Business

In [27]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

  Name_x          Role Name_y      School
0    Pam  Receptionist   Mike    Business
1    Jim     Sales Man  Kevin  Accounting
2   Mike       Manager    Jim   Marketing

In [29]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])
staff_df

            Location   Name            Role
0       State Street  Kelly  Director of HR
1  Washington Avenue  Sally  Course liasion
2  Washington Avenue  James          Grader

In [30]:
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
                           {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])
student_df

               Location   Name       School
0  1024 Billiard Avenue  James     Business
1  Fraternity House #22   Mike          Law
2   512 Wilson Crescent  Sally  Engineering

In [31]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

,Location_x,Name_x,Role,Location_y,Name_y,School
0,State Street,Kelly,Director of HR,1024 Billiard Avenue,James,Business
1,Washington Avenue,Sally,Course liasion,Fraternity House #22,Mike,Law
2,Washington Avenue,James,Grader,512 Wilson Crescent,Sally,Engineering

In [32]:
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

          Location_x   Name            Role            Location_y       School
0       State Street  Kelly  Director of HR                   NaN          NaN
1  Washington Avenue  Sally  Course liasion   512 Wilson Crescent  Engineering
2  Washington Avenue  James          Grader  1024 Billiard Avenue     Business

In [34]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])
staff_df

  First Name   Last Name            Role
0      Kelly  Desjardins  Director of HR
1      Sally      Brooks  Course liasion
2      James       Wilde          Grader

In [35]:
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])

In [36]:
student_df

  First Name Last Name       School
0      James   Hammond     Business
1       Mike     Smith          Law
2      Sally    Brooks  Engineering

In [37]:
pd.merge(staff_df, student_df, how='outer', left_on=['First Name','Last Name'], right_on=['First Name','Last Name'])

  First Name   Last Name            Role       School
0      Kelly  Desjardins  Director of HR          NaN
1      Sally      Brooks  Course liasion  Engineering
2      James       Wilde          Grader          NaN
3      James     Hammond             NaN     Business
4       Mike       Smith             NaN          Law

In [40]:
pd.merge(staff_df, student_df, how='inner', left_on=['First Name','Last Name'], right_on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

In [41]:
pd.merge(staff_df, student_df, how='left', left_on=['First Name','Last Name'], right_on=['First Name','Last Name'])

  First Name   Last Name            Role       School
0      Kelly  Desjardins  Director of HR          NaN
1      Sally      Brooks  Course liasion  Engineering
2      James       Wilde          Grader          NaN

In [42]:
pd.merge(staff_df, student_df, how='right', left_on=['First Name','Last Name'], right_on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering
1      James   Hammond             NaN     Business
2       Mike     Smith             NaN          Law

In [51]:
products = pd.DataFrame([
    {'Product ID':4109,'Price':5.0,'Product':'Sushi Roll'},
    {'Product ID':1412,'Price':0.5,'Product':'Egg'},
    {'Product ID':8931,'Price':1.5,'Product':'Bagel'}
])
products = products.set_index('Product ID')

In [52]:
products

            Price     Product
Product ID
4109          5.0  Sushi Roll
1412          0.5         Egg
8931          1.5       Bagel

In [44]:
invoices = pd.DataFrame([
    {'Customer':'Ali','Product ID':4109,'Quantity':1},
    {'Customer':'Eric','Product ID':1412,'Quantity':12},
    {'Customer':'Ande','Product ID':8931,'Quantity':6},
    {'Customer':'Sam','Product ID':4109,'Quantity':2}
])
invoices

  Customer  Product ID  Quantity
0      Ali        4109         1
1     Eric        1412        12
2     Ande        8931         6
3      Sam        4109         2

In [54]:
pd.merge(products,invoices,how='outer',left_index=True,right_on='Product ID')

   Price     Product Customer  Product ID  Quantity
0    5.0  Sushi Roll      Ali        4109         1
3    5.0  Sushi Roll      Sam        4109         2
1    0.5         Egg     Eric        1412        12
2    1.5       Bagel     Ande        8931         6

In [55]:
pd.merge(products,invoices,left_index=True,right_on='Product ID')

   Price     Product Customer  Product ID  Quantity
0    5.0  Sushi Roll      Ali        4109         1
3    5.0  Sushi Roll      Sam        4109         2
1    0.5         Egg     Eric        1412        12
2    1.5       Bagel     Ande        8931         6